cid_list = [
    {
        "id": 1,
        "code": "86",
        "name": "中国大陆"
    },
    {
        "id": 5,
        "code": "852",
        "name": "中国香港特别行政区"
    },
    {
        "id": 2,
        "code": "853",
        "name": "中国澳门特别行政区"
    },
    {
        "id": 3,
        "code": "886",
        "name": "中国台湾"
    },
    {
        "id": 4,
        "code": "1",
        "name": "美国"
    },
    {
        "id": 6,
        "code": "32",
        "name": "比利时"
    },
    {
        "id": 7,
        "code": "61",
        "name": "澳大利亚"
    },
    {
        "id": 8,
        "code": "33",
        "name": "法国"
    },
    {
        "id": 9,
        "code": "1",
        "name": "加拿大"
    },
    {
        "id": 10,
        "code": "81",
        "name": "日本"
    },
    {
        "id": 11,
        "code": "65",
        "name": "新加坡"
    },
    {
        "id": 12,
        "code": "82",
        "name": "韩国"
    },
    {
        "id": 13,
        "code": "60",
        "name": "马来西亚"
    },
    {
        "id": 14,
        "code": "44",
        "name": "英国"
    },
    {
        "id": 15,
        "code": "39",
        "name": "意大利"
    },
    {
        "id": 16,
        "code": "49",
        "name": "德国"
    },
    {
        "id": 18,
        "code": "7",
        "name": "俄罗斯"
    },
    {
        "id": 153,
        "code": "1681",
        "name": "瓦利斯群岛和富图纳群岛"
    },
    {
        "id": 152,
        "code": "351",
        "name": "葡萄牙"
    },
    {
        "id": 151,
        "code": "680",
        "name": "帕劳"
    },
    {
        "id": 150,
        "code": "672",
        "name": "诺福克岛"
    },
    {
        "id": 149,
        "code": "47",
        "name": "挪威"
    },
    {
        "id": 148,
        "code": "683",
        "name": "纽埃岛"
    },
    {
        "id": 147,
        "code": "234",
        "name": "尼日利亚"
    },
    {
        "id": 146,
        "code": "227",
        "name": "尼日尔"
    },
    {
        "id": 145,
        "code": "505",
        "name": "尼加拉瓜"
    },
    {
        "id": 144,
        "code": "977",
        "name": "尼泊尔"
    },
    {
        "id": 143,
        "code": "674",
        "name": "瑙鲁"
    },
    {
        "id": 154,
        "code": "995",
        "name": "格鲁吉亚"
    },
    {
        "id": 155,
        "code": "46",
        "name": "瑞典"
    },
    {
        "id": 165,
        "code": "966",
        "name": "沙特阿拉伯"
    },
    {
        "id": 164,
        "code": "259",
        "name": "桑给巴尔岛"
    },
    {
        "id": 163,
        "code": "248",
        "name": "塞舌尔共和国"
    },
    {
        "id": 162,
        "code": "357",
        "name": "塞浦路斯"
    },
    {
        "id": 161,
        "code": "221",
        "name": "塞内加尔"
    },
    {
        "id": 160,
        "code": "232",
        "name": "塞拉利昂"
    },
    {
        "id": 159,
        "code": "684",
        "name": "萨摩亚，东部"
    },
    {
        "id": 158,
        "code": "685",
        "name": "萨摩亚，西部"
    },
    {
        "id": 157,
        "code": "503",
        "name": "萨尔瓦多"
    },
    {
        "id": 156,
        "code": "41",
        "name": "瑞士"
    },
    {
        "id": 166,
        "code": "239",
        "name": "圣多美和普林西比"
    },
    {
        "id": 142,
        "code": "381",
        "name": "塞尔维亚"
    },
    {
        "id": 141,
        "code": "27",
        "name": "南非"
    },
    {
        "id": 128,
        "code": "222",
        "name": "毛里塔尼亚"
    },
    {
        "id": 127,
        "code": "230",
        "name": "毛里求斯"
    },
    {
        "id": 126,
        "code": "692",
        "name": "马歇尔岛"
    },
    {
        "id": 125,
        "code": "596",
        "name": "马提尼克岛"
    },
    {
        "id": 124,
        "code": "389",
        "name": "马其顿"
    },
    {
        "id": 123,
        "code": "1670",
        "name": "马里亚纳岛"
    },
    {
        "id": 122,
        "code": "223",
        "name": "马里"
    },
    {
        "id": 121,
        "code": "265",
        "name": "马拉维"
    },
    {
        "id": 120,
        "code": "356",
        "name": "马耳他"
    },
    {
        "id": 119,
        "code": "960",
        "name": "马尔代夫"
    },
    {
        "id": 129,
        "code": "976",
        "name": "蒙古"
    },
    {
        "id": 130,
        "code": "1664",
        "name": "蒙特塞拉特岛"
    },
    {
        "id": 140,
        "code": "264",
        "name": "纳米比亚"
    },
    {
        "id": 139,
        "code": "52",
        "name": "墨西哥"
    },
    {
        "id": 138,
        "code": "258",
        "name": "莫桑比克"
    },
    {
        "id": 137,
        "code": "377",
        "name": "摩纳哥"
    },
    {
        "id": 136,
        "code": "212",
        "name": "摩洛哥"
    },
    {
        "id": 135,
        "code": "373",
        "name": "摩尔多瓦"
    },
    {
        "id": 134,
        "code": "95",
        "name": "缅甸"
    },
    {
        "id": 133,
        "code": "691",
        "name": "密克罗尼西亚"
    },
    {
        "id": 132,
        "code": "51",
        "name": "秘鲁"
    },
    {
        "id": 131,
        "code": "880",
        "name": "孟加拉国"
    },
    {
        "id": 118,
        "code": "261",
        "name": "马达加斯加"
    },
    {
        "id": 167,
        "code": "1784",
        "name": "圣卢西亚"
    },
    {
        "id": 216,
        "code": "56",
        "name": "智利"
    },
    {
        "id": 203,
        "code": "1876",
        "name": "牙买加"
    },
    {
        "id": 202,
        "code": "963",
        "name": "叙利亚"
    },
    {
        "id": 201,
        "code": "36",
        "name": "匈牙利"
    },
    {
        "id": 200,
        "code": "225",
        "name": "科特迪瓦"
    },
    {
        "id": 199,
        "code": "30",
        "name": "希腊"
    },
    {
        "id": 198,
        "code": "34",
        "name": "西班牙"
    },
    {
        "id": 197,
        "code": "998",
        "name": "乌兹别克斯坦"
    },
    {
        "id": 196,
        "code": "598",
        "name": "乌拉圭"
    },
    {
        "id": 195,
        "code": "380",
        "name": "乌克兰"
    },
    {
        "id": 194,
        "code": "256",
        "name": "乌干达"
    },
    {
        "id": 204,
        "code": "374",
        "name": "亚美尼亚"
    },
    {
        "id": 205,
        "code": "967",
        "name": "也门"
    },
    {
        "id": 215,
        "code": "350",
        "name": "直布罗陀"
    },
    {
        "id": 214,
        "code": "235",
        "name": "乍得"
    },
    {
        "id": 213,
        "code": "260",
        "name": "赞比亚"
    },
    {
        "id": 212,
        "code": "84",
        "name": "越南"
    },
    {
        "id": 211,
        "code": "962",
        "name": "约旦"
    },
    {
        "id": 210,
        "code": "62",
        "name": "印尼"
    },
    {
        "id": 209,
        "code": "91",
        "name": "印度"
    },
    {
        "id": 208,
        "code": "972",
        "name": "以色列"
    },
    {
        "id": 207,
        "code": "98",
        "name": "伊朗"
    },
    {
        "id": 206,
        "code": "964",
        "name": "伊拉克"
    },
    {
        "id": 193,
        "code": "673",
        "name": "文莱"
    },
    {
        "id": 192,
        "code": "58",
        "name": "委内瑞拉"
    },
    {
        "id": 191,
        "code": "1284",
        "name": "维珍群岛(英属)"
    },
    {
        "id": 178,
        "code": "66",
        "name": "泰国"
    },
    {
        "id": 177,
        "code": "252",
        "name": "索马里"
    },
    {
        "id": 176,
        "code": "677",
        "name": "所罗门群岛"
    },
    {
        "id": 175,
        "code": "597",
        "name": "苏里南"
    },
    {
        "id": 174,
        "code": "249",
        "name": "苏丹"
    },
    {
        "id": 173,
        "code": "268",
        "name": "斯威士兰"
    },
    {
        "id": 172,
        "code": "386",
        "name": "斯洛文尼亚"
    },
    {
        "id": 171,
        "code": "421",
        "name": "斯洛伐克"
    },
    {
        "id": 170,
        "code": "94",
        "name": "斯里兰卡"
    },
    {
        "id": 169,
        "code": "508",
        "name": "圣皮埃尔和密克隆群岛"
    },
    {
        "id": 179,
        "code": "255",
        "name": "坦桑尼亚"
    },
    {
        "id": 180,
        "code": "676",
        "name": "汤加"
    },
    {
        "id": 190,
        "code": "1340",
        "name": "维珍群岛(美属)"
    },
    {
        "id": 189,
        "code": "678",
        "name": "瓦努阿图"
    },
    {
        "id": 188,
        "code": "690",
        "name": "托克劳岛"
    },
    {
        "id": 187,
        "code": "993",
        "name": "土库曼斯坦"
    },
    {
        "id": 186,
        "code": "90",
        "name": "土耳其"
    },
    {
        "id": 185,
        "code": "688",
        "name": "图瓦卢"
    },
    {
        "id": 184,
        "code": "216",
        "name": "突尼斯"
    },
    {
        "id": 183,
        "code": "247",
        "name": "阿森松岛"
    },
    {
        "id": 182,
        "code": "1868",
        "name": "特立尼达和多巴哥"
    },
    {
        "id": 181,
        "code": "1649",
        "name": "特克斯和凯科斯"
    },
    {
        "id": 168,
        "code": "378",
        "name": "圣马力诺"
    },
    {
        "id": 67,
        "code": "594",
        "name": "法属圭亚那"
    },
    {
        "id": 54,
        "code": "975",
        "name": "不丹"
    },
    {
        "id": 53,
        "code": "267",
        "name": "博茨瓦纳"
    },
    {
        "id": 52,
        "code": "501",
        "name": "伯利兹"
    },
    {
        "id": 51,
        "code": "591",
        "name": "玻利维亚"
    },
    {
        "id": 50,
        "code": "48",
        "name": "波兰"
    },
    {
        "id": 49,
        "code": "387",
        "name": "波黑"
    },
    {
        "id": 48,
        "code": "1787",
        "name": "波多黎各"
    },
    {
        "id": 47,
        "code": "354",
        "name": "冰岛"
    },
    {
        "id": 46,
        "code": "229",
        "name": "贝宁"
    },
    {
        "id": 45,
        "code": "359",
        "name": "保加利亚"
    },
    {
        "id": 55,
        "code": "226",
        "name": "布基纳法索"
    },
    {
        "id": 56,
        "code": "257",
        "name": "布隆迪"
    },
    {
        "id": 66,
        "code": "689",
        "name": "法属波利尼西亚"
    },
    {
        "id": 65,
        "code": "298",
        "name": "法罗岛"
    },
    {
        "id": 64,
        "code": "291",
        "name": "厄立特里亚"
    },
    {
        "id": 63,
        "code": "593",
        "name": "厄瓜多尔"
    },
    {
        "id": 62,
        "code": "1809",
        "name": "多米尼加代表"
    },
    {
        "id": 61,
        "code": "1767",
        "name": "多米尼加"
    },
    {
        "id": 60,
        "code": "228",
        "name": "多哥"
    },
    {
        "id": 59,
        "code": "246",
        "name": "迪戈加西亚岛"
    },
    {
        "id": 58,
        "code": "45",
        "name": "丹麦"
    },
    {
        "id": 57,
        "code": "240",
        "name": "赤道几内亚"
    },
    {
        "id": 44,
        "code": "1441",
        "name": "百慕大群岛"
    },
    {
        "id": 43,
        "code": "375",
        "name": "白俄罗斯"
    },
    {
        "id": 42,
        "code": "55",
        "name": "巴西"
    },
    {
        "id": 29,
        "code": "353",
        "name": "爱尔兰"
    },
    {
        "id": 28,
        "code": "251",
        "name": "埃塞俄比亚"
    },
    {
        "id": 27,
        "code": "20",
        "name": "埃及"
    },
    {
        "id": 26,
        "code": "994",
        "name": "阿塞拜疆"
    },
    {
        "id": 25,
        "code": "968",
        "name": "阿曼"
    },
    {
        "id": 24,
        "code": "971",
        "name": "阿联酋"
    },
    {
        "id": 23,
        "code": "54",
        "name": "阿根廷"
    },
    {
        "id": 22,
        "code": "93",
        "name": "阿富汗"
    },
    {
        "id": 21,
        "code": "213",
        "name": "阿尔及利亚"
    },
    {
        "id": 20,
        "code": "355",
        "name": "阿尔巴尼亚"
    },
    {
        "id": 30,
        "code": "372",
        "name": "爱沙尼亚"
    },
    {
        "id": 31,
        "code": "376",
        "name": "安道尔"
    },
    {
        "id": 41,
        "code": "507",
        "name": "巴拿马"
    },
    {
        "id": 40,
        "code": "973",
        "name": "巴林"
    },
    {
        "id": 39,
        "code": "595",
        "name": "巴拉圭"
    },
    {
        "id": 38,
        "code": "92",
        "name": "巴基斯坦"
    },
    {
        "id": 37,
        "code": "1242",
        "name": "巴哈马群岛"
    },
    {
        "id": 36,
        "code": "675",
        "name": "巴布亚新几内亚"
    },
    {
        "id": 35,
        "code": "1246",
        "name": "巴巴多斯"
    },
    {
        "id": 34,
        "code": "43",
        "name": "奥地利"
    },
    {
        "id": 33,
        "code": "1268",
        "name": "安提瓜岛和巴布达"
    },
    {
        "id": 32,
        "code": "244",
        "name": "安哥拉"
    },
    {
        "id": 19,
        "code": "64",
        "name": "新西兰"
    },
    {
        "id": 68,
        "code": "236",
        "name": "非洲中部"
    },
    {
        "id": 117,
        "code": "40",
        "name": "罗马尼亚"
    },
    {
        "id": 104,
        "code": "965",
        "name": "科威特"
    },
    {
        "id": 103,
        "code": "269",
        "name": "科摩罗"
    },
    {
        "id": 102,
        "code": "1345",
        "name": "开曼群岛"
    },
    {
        "id": 101,
        "code": "974",
        "name": "卡塔尔"
    },
    {
        "id": 100,
        "code": "237",
        "name": "喀麦隆"
    },
    {
        "id": 99,
        "code": "262",
        "name": "聚会岛"
    },
    {
        "id": 98,
        "code": "263",
        "name": "津巴布韦"
    },
    {
        "id": 97,
        "code": "420",
        "name": "捷克"
    },
    {
        "id": 96,
        "code": "855",
        "name": "柬埔寨"
    },
    {
        "id": 95,
        "code": "241",
        "name": "加蓬"
    },
    {
        "id": 105,
        "code": "385",
        "name": "克罗地亚"
    },
    {
        "id": 106,
        "code": "254",
        "name": "肯尼亚"
    },
    {
        "id": 116,
        "code": "250",
        "name": "卢旺达"
    },
    {
        "id": 115,
        "code": "352",
        "name": "卢森堡"
    },
    {
        "id": 114,
        "code": "218",
        "name": "利比亚"
    },
    {
        "id": 113,
        "code": "231",
        "name": "利比里亚"
    },
    {
        "id": 112,
        "code": "370",
        "name": "立陶宛"
    },
    {
        "id": 111,
        "code": "961",
        "name": "黎巴嫩"
    },
    {
        "id": 110,
        "code": "856",
        "name": "老挝"
    },
    {
        "id": 109,
        "code": "266",
        "name": "莱索托"
    },
    {
        "id": 108,
        "code": "371",
        "name": "拉脱维亚"
    },
    {
        "id": 107,
        "code": "682",
        "name": "库克岛"
    },
    {
        "id": 94,
        "code": "233",
        "name": "加纳"
    },
    {
        "id": 93,
        "code": "245",
        "name": "几内亚比绍"
    },
    {
        "id": 92,
        "code": "224",
        "name": "几内亚"
    },
    {
        "id": 79,
        "code": "1473",
        "name": "格林纳达"
    },
    {
        "id": 78,
        "code": "506",
        "name": "哥斯达黎加"
    },
    {
        "id": 77,
        "code": "57",
        "name": "哥伦比亚"
    },
    {
        "id": 76,
        "code": "243",
        "name": "刚果(金)"
    },
    {
        "id": 75,
        "code": "242",
        "name": "刚果"
    },
    {
        "id": 74,
        "code": "220",
        "name": "冈比亚"
    },
    {
        "id": 73,
        "code": "500",
        "name": "福克兰岛"
    },
    {
        "id": 72,
        "code": "238",
        "name": "佛得角"
    },
    {
        "id": 71,
        "code": "358",
        "name": "芬兰"
    },
    {
        "id": 70,
        "code": "679",
        "name": "斐济"
    },
    {
        "id": 80,
        "code": "299",
        "name": "格陵兰岛"
    },
    {
        "id": 81,
        "code": "53",
        "name": "古巴"
    },
    {
        "id": 91,
        "code": "996",
        "name": "吉尔吉斯斯坦"
    },
    {
        "id": 90,
        "code": "253",
        "name": "吉布提"
    },
    {
        "id": 89,
        "code": "686",
        "name": "基里巴斯"
    },
    {
        "id": 88,
        "code": "1808",
        "name": "维克岛"
    },
    {
        "id": 87,
        "code": "504",
        "name": "洪都拉斯"
    },
    {
        "id": 86,
        "code": "31",
        "name": "荷兰"
    },
    {
        "id": 85,
        "code": "850",
        "name": "朝鲜"
    },
    {
        "id": 84,
        "code": "509",
        "name": "海地"
    },
    {
        "id": 83,
        "code": "1671",
        "name": "关岛"
    },
    {
        "id": 82,
        "code": "590",
        "name": "瓜德罗普岛"
    },
    {
        "id": 69,
        "code": "63",
        "name": "菲律宾"
    }
]