import gettext

_ = gettext.gettext

guide_1_msg = _("""\
开始使用前，请先完成以下简短的引导。

点击“下一步”按钮继续。

""")

guide_2_msg = _("""\
1.本项目仅支持下载 B 站视频，不支持其他视频平台。

2.本项目不提供破解大会员专享视频、付费视频、充电视频等功能，如有相关需求，请开通B站大会员服务、购买付费内容、向UP主充电解锁。

3.用户能否下载上述内容，取决于所登录账号的会员状态和相应权限，也就是说能账号看什么就能下载什么。

4.如果视频本身就有水印，那么下载下来就会带水印，与B站客户端看到的效果一致。除非在上传视频时不带水印，否则无法下载无水印的视频。

特此说明，请勿再次咨询以上相关问题。

""")

guide_3_msg = _("""\
本项目仅供个人学习与研究用途，任何通过本项目下载的内容仅限于个人使用，不得用于任何形式的商业目的、公开传播或分发。

用户需自行承担使用本项目可能带来的所有风险，项目开发者不对因使用本项目所引发的任何法律纠纷、版权问题或其他损害承担责任。

""")

guide_4_msg = _("""\
建议详细阅读说明文档，以便快速上手并充分了解各项功能设置。

欢迎加入社区，获取项目最新动态、问题答疑和技术交流。

""")